// TODO DB
var sampleJson = [
  {
    "key": "01",
    "title": "性欲診断",
    "color": "#F27398",
    "fontColor": "#FFF",
    "lists": [
      {
        "q": "あなたは週に何回自慰行為を行いますか？",
        "as": [
          {
            "a": "0回",
            "p": 0
          },
          {
            "a": "そこそこ",
            "p": 50
          },
          {
            "a": "天才",
            "p": 100
          }
        ]
      },
      {
        "q": "あなたは馬鹿ですか２？",
        "as": [
          {
            "a": "バカ２",
            "p": 0
          },
          {
            "a": "そこそこ２",
            "p": 50
          },
          {
            "a": "天才２",
            "p": 100
          }
        ]
      }
    ],
    "points": [
      {
        "text": "ぐろいやばい",
        "point": 200
      },
      {
        "text": "まずまず",
        "point": 100
      },
      {
        "text": "逆にやばい",
        "point": 50
      }
    ]
  },
  {
    "key": "02",
    "title": "ITリテラシー診断",
    "color": "#FBA848",
    "fontColor": "#FFF",
    "lists": [
      {
        "q": "あなたは馬鹿ですか？",
        "page": "3-1",
         "as": [
          {
            "a": "バカ",
            "p": 0
          },
          {
            "a": "そこそこ",
            "p": 50
          },
          {
            "a": "天才",
            "p": 100
          }
        ]
      },
      {
        "q": "あなたは馬鹿ですか２？",
        "as": [
          {
            "a": "バカ２",
            "p": 0
          },
          {
            "a": "そこそこ２",
            "p": 50
          },
          {
            "a": "天才２",
            "p": 100
          }
        ]
      }
    ]
  }
];

var pointJson = [
  {
    "key": "01",
    "points": [
      {
        "text": "ぐろいやばい",
        "point": 200
      },
      {
        "text": "まずまず",
        "point": 100
      },
      {
        "text": "逆にやばい",
        "point": 50
      }
    ]
  },
  {
    "key": "02",
    "points": [
      {
        "text": "ぐろいやばい",
        "point": 200
      },
      {
        "text": "まずまず",
        "point": 100
      },
      {
        "text": "逆にやばい",
        "point": 50
      }
    ]
  }
];